Autodesk.Revit.DB.DesignOption.GetActiveDesignOptionId(Autodesk.Revit.DB.Document)
Gets the active design option id for the current design option set.
document:
The document.
Returns:
The active design option id. It can be invalid id if there is no active design option in the model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011